Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.lambda-getRuns...
- sbeacon.lambda-getRuns in .terraform/modules/sbeacon.lambda-getRuns
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.lambda-indexer...
- sbeacon.lambda-indexer in .terraform/modules/sbeacon.lambda-indexer
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.lambda-logEmailDelivery...
- sbeacon.lambda-logEmailDelivery in .terraform/modules/sbeacon.lambda-logEmailDelivery
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.lambda-performQuery...
- sbeacon.lambda-performQuery in .terraform/modules/sbeacon.lambda-performQuery
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.lambda-splitQuery...
- sbeacon.lambda-splitQuery in .terraform/modules/sbeacon.lambda-splitQuery
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.lambda-submitDataset...
- sbeacon.lambda-submitDataset in .terraform/modules/sbeacon.lambda-submitDataset
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.lambda-updateFiles...
- sbeacon.lambda-updateFiles in .terraform/modules/sbeacon.lambda-updateFiles
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.python_libraries_layer...
- sbeacon.python_libraries_layer in .terraform/modules/sbeacon.python_libraries_layer
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for sbeacon.python_modules_layer...
- sbeacon.python_modules_layer in .terraform/modules/sbeacon.python_modules_layer
- svep in svep
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for svep.docker_image_pluginConsequence_lambda...
- svep.docker_image_pluginConsequence_lambda in .terraform/modules/svep.docker_image_pluginConsequence_lambda/modules/docker-build
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-concat...
- svep.lambda-concat in .terraform/modules/svep.lambda-concat
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-concatPages...
- svep.lambda-concatPages in .terraform/modules/svep.lambda-concatPages
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-concatStarter...
- svep.lambda-concatStarter in .terraform/modules/svep.lambda-concatStarter
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-createPages...
- svep.lambda-createPages in .terraform/modules/svep.lambda-createPages
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-getResultsURL...
- svep.lambda-getResultsURL in .terraform/modules/svep.lambda-getResultsURL
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-initQuery...
- svep.lambda-initQuery in .terraform/modules/svep.lambda-initQuery
Downloading registry.terraform.io/terraform-aws-modules/lambda/aws 7.16.0 for svep.lambda-pluginConsequence...
- svep.lambda-pluginConsequence in .terraform/modules/svep.lambda-pluginConsequence
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-pluginUpdownstream...
- svep.lambda-pluginUpdownstream in .terraform/modules/svep.lambda-pluginUpdownstream
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-queryGTF...
- svep.lambda-queryGTF in .terraform/modules/svep.lambda-queryGTF
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-queryVCF...
- svep.lambda-queryVCF in .terraform/modules/svep.lambda-queryVCF
Downloading git::https://github.com/bhosking/terraform-aws-lambda.git for svep.lambda-queryVCFsubmit...
- svep.lambda-queryVCFsubmit in .terraform/modules/svep.lambda-queryVCFsubmit
- webgui in webgui/terraform-aws
Initializing provider plugins...
- Finding hashicorp/local versions matching ">= 1.0.0, >= 2.4.1"...
- Finding kreuzwerker/docker versions matching ">= 3.0.0, >= 3.0.2"...
- Finding hashicorp/null versions matching ">= 2.0.0, >= 3.2.1, >= 3.2.2"...
- Finding hashicorp/aws versions matching ">= 4.22.0, >= 5.14.0, >= 5.33.0, >= 5.69.0, >= 5.70.0"...
- Finding hashicorp/external versions matching ">= 1.0.0, >= 2.3.1, >= 2.3.2"...
- Finding hashicorp/archive versions matching ">= 2.4.2"...
- Installing hashicorp/local v2.5.2...
- Installed hashicorp/local v2.5.2 (signed by HashiCorp)
- Installing kreuzwerker/docker v3.0.2...
- Installed kreuzwerker/docker v3.0.2 (self-signed, key ID BD080C4571C6104C)
- Installing hashicorp/null v3.2.3...
- Installed hashicorp/null v3.2.3 (signed by HashiCorp)
- Installing hashicorp/aws v5.80.0...
- Installed hashicorp/aws v5.80.0 (signed by HashiCorp)
- Installing hashicorp/external v2.3.4...
- Installed hashicorp/external v2.3.4 (signed by HashiCorp)
- Installing hashicorp/archive v2.7.0...
- Installed hashicorp/archive v2.7.0 (signed by HashiCorp)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Missing backend configuration
│ 
│ -backend-config was used without a "backend" block in the configuration.
│ 
│ If you intended to override the default local backend configuration,
│ no action is required, but you may add an explicit backend block to your
│ configuration to clear this warning:
│ 
│ terraform {
│   backend "local" {}
│ }
│ 
│ However, if you intended to override a defined backend, please verify that
│ the backend configuration is present and valid.
│ 
╵
Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Workspace "default" already exists

module.svep.module.lambda-initQuery.data.external.archive[0]: Reading...
module.svep.data.external.pluginConsequence_lambda_source_hash: Reading...
module.svep.module.lambda-createPages.data.external.archive[0]: Reading...
module.svep.module.lambda-pluginUpdownstream.data.external.archive[0]: Reading...
module.sbeacon.module.lambda-getBiosamples.data.external.archive_prepare[0]: Reading...
module.svep.module.lambda-concat.data.external.archive[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getRuns.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getMap.data.external.archive_prepare[0]: Reading...
module.svep.module.lambda-concat.data.external.archive[0]: Read complete after 2s [id=-]
module.svep.module.lambda-createPages.data.external.archive[0]: Read complete after 2s [id=-]
module.sbeacon.module.lambda-data-portal.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-admin.data.external.archive_prepare[0]: Reading...
module.svep.data.external.pluginConsequence_lambda_source_hash: Read complete after 3s [id=-]
module.svep.module.lambda-concatStarter.data.external.archive[0]: Reading...
module.sbeacon.module.lambda-getBiosamples.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.svep.module.lambda-concatPages.data.external.archive[0]: Reading...
module.svep.module.lambda-concatStarter.data.external.archive[0]: Read complete after 1s [id=-]
module.svep.module.lambda-queryVCF.data.external.archive[0]: Reading...
module.svep.module.lambda-pluginUpdownstream.data.external.archive[0]: Read complete after 4s [id=-]
module.svep.module.lambda-initQuery.data.external.archive[0]: Read complete after 4s [id=-]
module.svep.module.lambda-queryGTF.data.external.archive[0]: Reading...
module.sbeacon.module.lambda-getConfiguration.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getRuns.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.svep.module.lambda-queryVCFsubmit.data.external.archive[0]: Reading...
module.sbeacon.module.lambda-getMap.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-performQuery.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-indexer.data.external.archive_prepare[0]: Reading...
module.svep.module.lambda-concatPages.data.external.archive[0]: Read complete after 2s [id=-]
module.svep.module.lambda-getResultsURL.data.external.archive[0]: Reading...
module.sbeacon.module.lambda-data-portal.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-admin.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-updateFiles.data.external.archive_prepare[0]: Reading...
module.svep.module.lambda-queryVCFsubmit.data.external.archive[0]: Read complete after 2s [id=-]
module.sbeacon.module.lambda-getEntryTypes.data.external.archive_prepare[0]: Reading...
module.svep.module.lambda-getResultsURL.data.external.archive[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-getProjects.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getConfiguration.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-getFilteringTerms.data.external.archive_prepare[0]: Reading...
module.svep.module.lambda-queryVCF.data.external.archive[0]: Read complete after 5s [id=-]
module.sbeacon.module.lambda-getIndividuals.data.external.archive_prepare[0]: Reading...
module.svep.module.lambda-queryGTF.data.external.archive[0]: Read complete after 5s [id=-]
module.sbeacon.module.lambda-getInfo.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-performQuery.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.python_modules_layer.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-indexer.data.external.archive_prepare[0]: Read complete after 5s [id=-]
module.sbeacon.module.lambda-splitQuery.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-updateFiles.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-getDatasets.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-getGenomicVariants.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-submitDataset.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getProjects.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-getEntryTypes.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-logEmailDelivery.data.external.archive_prepare[0]: Reading...
module.sbeacon.data.archive_file.binaries_layer: Reading...
module.sbeacon.data.archive_file.binaries_layer: Read complete after 0s [id=7b9c741740efa30bdf5cbf4f419b1dd3e6749882]
module.sbeacon.module.lambda-getFilteringTerms.data.external.archive_prepare[0]: Read complete after 3s [id=-]
module.sbeacon.module.lambda-splitQuery.data.external.archive_prepare[0]: Read complete after 2s [id=-]
module.sbeacon.module.lambda-logEmailDelivery.data.external.archive_prepare[0]: Read complete after 2s [id=-]
module.sbeacon.module.lambda-submitDataset.data.external.archive_prepare[0]: Read complete after 3s [id=-]
module.sbeacon.module.lambda-getInfo.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-getIndividuals.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.lambda-getGenomicVariants.data.external.archive_prepare[0]: Read complete after 3s [id=-]
module.sbeacon.module.lambda-getDatasets.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.python_modules_layer.data.external.archive_prepare[0]: Read complete after 5s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1813860dc15347940c890869633026551ce489e2547e90245dfc53546eb8d24a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1813860dc15347940c890869633026551ce489e2547e90245dfc53546eb8d24a.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/1813860dc15347940c890869633026551ce489e2547e90245dfc53546eb8d24a.zip"
          + "timestamp" = "1733634433243132200"
        }
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8f3b553fd58dc8c2297d448da37218cfeed2814e75d2e3aa15be834a2338f7cf.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8f3b553fd58dc8c2297d448da37218cfeed2814e75d2e3aa15be834a2338f7cf.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/8f3b553fd58dc8c2297d448da37218cfeed2814e75d2e3aa15be834a2338f7cf.zip"
          + "timestamp" = "1733634433638925000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getAnalyses",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/93aef72e169a003d9533e87881860d746280442604e1d6c10736500ca461cb26.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/93aef72e169a003d9533e87881860d746280442604e1d6c10736500ca461cb26.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/93aef72e169a003d9533e87881860d746280442604e1d6c10736500ca461cb26.zip"
          + "timestamp" = "1733634432831389000"
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getBiosamples",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3e1ab74245664023c6319ca689e113600d6c6e1f7169fe7ffdd1e00a7bac42e7.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3e1ab74245664023c6319ca689e113600d6c6e1f7169fe7ffdd1e00a7bac42e7.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/3e1ab74245664023c6319ca689e113600d6c6e1f7169fe7ffdd1e00a7bac42e7.zip"
          + "timestamp" = "1733634431133410000"
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getConfiguration",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          + "timestamp" = "1733634435655261000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a6c09628c4d02568cc42b7b9f3f97c8c16debf5436c4b32081cbaf0d6790fbcb.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a6c09628c4d02568cc42b7b9f3f97c8c16debf5436c4b32081cbaf0d6790fbcb.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a6c09628c4d02568cc42b7b9f3f97c8c16debf5436c4b32081cbaf0d6790fbcb.zip"
          + "timestamp" = "1733634441535198000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getEntryTypes",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          + "timestamp" = "1733634438337264000"
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getFilteringTerms",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f7bf6d08d424807feb0fa4f837d26829014e85a994188b2dec1931511f6773e7.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f7bf6d08d424807feb0fa4f837d26829014e85a994188b2dec1931511f6773e7.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/f7bf6d08d424807feb0fa4f837d26829014e85a994188b2dec1931511f6773e7.zip"
          + "timestamp" = "1733634439214192000"
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getGenomicVariants",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ac012ebf7a8a458e1c1def386c8ec21aaa5d484b3193c717add8ee40b259e0e1.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ac012ebf7a8a458e1c1def386c8ec21aaa5d484b3193c717add8ee40b259e0e1.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/ac012ebf7a8a458e1c1def386c8ec21aaa5d484b3193c717add8ee40b259e0e1.zip"
          + "timestamp" = "1733634440936849200"
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getIndividuals",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3d35a776b702b8e74c69454624f0ba5921c5a2e49dd90abcf31efa38a14d8128.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3d35a776b702b8e74c69454624f0ba5921c5a2e49dd90abcf31efa38a14d8128.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/3d35a776b702b8e74c69454624f0ba5921c5a2e49dd90abcf31efa38a14d8128.zip"
          + "timestamp" = "1733634440924264000"
        }
    }

  # module.sbeacon.module.lambda-getInfo.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getInfo",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/938ce1273388dd0843ed6ce8e3ed4f5cee5f73a956368eaa04388a15b8a12a3f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/938ce1273388dd0843ed6ce8e3ed4f5cee5f73a956368eaa04388a15b8a12a3f.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/938ce1273388dd0843ed6ce8e3ed4f5cee5f73a956368eaa04388a15b8a12a3f.zip"
          + "timestamp" = "1733634440527815200"
        }
    }

  # module.sbeacon.module.lambda-getMap.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getMap",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          + "timestamp" = "1733634432614323000"
        }
    }

  # module.sbeacon.module.lambda-getProjects.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getProjects",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8a7e7a7ce7a49849c184297d09ebad04394caf76a6ee5eba9b384cf78193b0be.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8a7e7a7ce7a49849c184297d09ebad04394caf76a6ee5eba9b384cf78193b0be.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/8a7e7a7ce7a49849c184297d09ebad04394caf76a6ee5eba9b384cf78193b0be.zip"
          + "timestamp" = "1733634438429814200"
        }
    }

  # module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getRuns",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f23679a2a686a81f3828197acc015f92642be678eeb3806d3f4a4b009e48e26b.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f23679a2a686a81f3828197acc015f92642be678eeb3806d3f4a4b009e48e26b.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/f23679a2a686a81f3828197acc015f92642be678eeb3806d3f4a4b009e48e26b.zip"
          + "timestamp" = "1733634432620903000"
        }
    }

  # module.sbeacon.module.lambda-indexer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/indexer",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/91b12fd8409cd434d1c9c5ec00f5fa599f1a4ae47aba31729fd993447b14846e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/91b12fd8409cd434d1c9c5ec00f5fa599f1a4ae47aba31729fd993447b14846e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/91b12fd8409cd434d1c9c5ec00f5fa599f1a4ae47aba31729fd993447b14846e.zip"
          + "timestamp" = "1733634437142098000"
        }
    }

  # module.sbeacon.module.lambda-logEmailDelivery.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/logEmailDelivery",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d77578f3a17687aeb7146b97134196c9c1ca12713b19ba53b35f0d9c6441ad0e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d77578f3a17687aeb7146b97134196c9c1ca12713b19ba53b35f0d9c6441ad0e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-logEmailDelivery.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/d77578f3a17687aeb7146b97134196c9c1ca12713b19ba53b35f0d9c6441ad0e.zip"
          + "timestamp" = "1733634440216402000"
        }
    }

  # module.sbeacon.module.lambda-performQuery.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/performQuery",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b56ac9968ad854df3fa7af9b6ab4463afb7aeabcfe698794d25df444a6cd636d.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b56ac9968ad854df3fa7af9b6ab4463afb7aeabcfe698794d25df444a6cd636d.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/b56ac9968ad854df3fa7af9b6ab4463afb7aeabcfe698794d25df444a6cd636d.zip"
          + "timestamp" = "1733634436839176800"
        }
    }

  # module.sbeacon.module.lambda-splitQuery.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/splitQuery",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2e819a58a21a07aa7c4b5109856665560d9be086446c2614e0e53300470211b7.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2e819a58a21a07aa7c4b5109856665560d9be086446c2614e0e53300470211b7.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/2e819a58a21a07aa7c4b5109856665560d9be086446c2614e0e53300470211b7.zip"
          + "timestamp" = "1733634439732302000"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/submitDataset",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b319912a6fb56d69ce8adbf77619db034ce4a877f8370a3bf60747706bf009c9.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b319912a6fb56d69ce8adbf77619db034ce4a877f8370a3bf60747706bf009c9.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-submitDataset.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/b319912a6fb56d69ce8adbf77619db034ce4a877f8370a3bf60747706bf009c9.zip"
          + "timestamp" = "1733634440228876200"
        }
    }

  # module.sbeacon.module.lambda-updateFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/updateFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7b98cfc9984898ef7c95c5688f8d5481b5d438812d0bec5e032020c27f236be2.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7b98cfc9984898ef7c95c5688f8d5481b5d438812d0bec5e032020c27f236be2.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/7b98cfc9984898ef7c95c5688f8d5481b5d438812d0bec5e032020c27f236be2.zip"
          + "timestamp" = "1733634437131986000"
        }
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
          + "timestamp" = "1733634437343022200"
        }
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.zip"
          + "timestamp" = "1733634441677226000"
        }
    }

  # module.svep.module.lambda-concat.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concat/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/bbbd4511d8c8c5971a63ed0bc58f8d14db2870a0e9bcc7ab6ec3b1d024c7fa9b.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/concat'"
          + "filename_new"   = "builds/bbbd4511d8c8c5971a63ed0bc58f8d14db2870a0e9bcc7ab6ec3b1d024c7fa9b.zip"
          + "filename_old"   = "builds/bbbd4511d8c8c5971a63ed0bc58f8d14db2870a0e9bcc7ab6ec3b1d024c7fa9b.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concat"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concat.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/bbbd4511d8c8c5971a63ed0bc58f8d14db2870a0e9bcc7ab6ec3b1d024c7fa9b.zip"
        }
    }

  # module.svep.module.lambda-concatPages.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concatPages/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/3cadda169cdfe5ba7c8bfe03c46938bb12e36a52b6ab4184a08ab64e8e0c6ec6.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/concatPages'"
          + "filename_new"   = "builds/3cadda169cdfe5ba7c8bfe03c46938bb12e36a52b6ab4184a08ab64e8e0c6ec6.zip"
          + "filename_old"   = "builds/3cadda169cdfe5ba7c8bfe03c46938bb12e36a52b6ab4184a08ab64e8e0c6ec6.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concatPages"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concatPages.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/3cadda169cdfe5ba7c8bfe03c46938bb12e36a52b6ab4184a08ab64e8e0c6ec6.zip"
        }
    }

  # module.svep.module.lambda-concatStarter.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concatStarter/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/3e1b36e8fa7448ec4b3e17e118f56cee49b7cd87d3be230cd7228de2b71d796a.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/concatStarter'"
          + "filename_new"   = "builds/3e1b36e8fa7448ec4b3e17e118f56cee49b7cd87d3be230cd7228de2b71d796a.zip"
          + "filename_old"   = "builds/3e1b36e8fa7448ec4b3e17e118f56cee49b7cd87d3be230cd7228de2b71d796a.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concatStarter"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concatStarter.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/3e1b36e8fa7448ec4b3e17e118f56cee49b7cd87d3be230cd7228de2b71d796a.zip"
        }
    }

  # module.svep.module.lambda-createPages.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-createPages/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/b33ca0f3211ecd49e94012e372419a023a01147ed0df87745d5af444765bae3c.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/createPages'"
          + "filename_new"   = "builds/b33ca0f3211ecd49e94012e372419a023a01147ed0df87745d5af444765bae3c.zip"
          + "filename_old"   = "builds/b33ca0f3211ecd49e94012e372419a023a01147ed0df87745d5af444765bae3c.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-createPages"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-createPages.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/b33ca0f3211ecd49e94012e372419a023a01147ed0df87745d5af444765bae3c.zip"
        }
    }

  # module.svep.module.lambda-getResultsURL.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-getResultsURL/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/7fdf2160679efa1602859b12dc0752d9158a618e921a76a8c29048e766e7e612.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/getResultsURL'"
          + "filename_new"   = "builds/7fdf2160679efa1602859b12dc0752d9158a618e921a76a8c29048e766e7e612.zip"
          + "filename_old"   = "builds/7fdf2160679efa1602859b12dc0752d9158a618e921a76a8c29048e766e7e612.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-getResultsURL"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-getResultsURL.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/7fdf2160679efa1602859b12dc0752d9158a618e921a76a8c29048e766e7e612.zip"
        }
    }

  # module.svep.module.lambda-initQuery.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-initQuery/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e18925bc0a8dcadc34c43bf86b94f73561964f705d1daef21ca46f80f4cbef4f.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/initQuery'"
          + "filename_new"   = "builds/e18925bc0a8dcadc34c43bf86b94f73561964f705d1daef21ca46f80f4cbef4f.zip"
          + "filename_old"   = "builds/e18925bc0a8dcadc34c43bf86b94f73561964f705d1daef21ca46f80f4cbef4f.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-initQuery"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-initQuery.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/e18925bc0a8dcadc34c43bf86b94f73561964f705d1daef21ca46f80f4cbef4f.zip"
        }
    }

  # module.svep.module.lambda-pluginUpdownstream.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginUpdownstream/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/53c078bfb2f0fd8e34d7acaaa1adad4ca9867673421d83d26f34901121b52fc5.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/pluginUpdownstream'"
          + "filename_new"   = "builds/53c078bfb2f0fd8e34d7acaaa1adad4ca9867673421d83d26f34901121b52fc5.zip"
          + "filename_old"   = "builds/53c078bfb2f0fd8e34d7acaaa1adad4ca9867673421d83d26f34901121b52fc5.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginUpdownstream"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-pluginUpdownstream.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/53c078bfb2f0fd8e34d7acaaa1adad4ca9867673421d83d26f34901121b52fc5.zip"
        }
    }

  # module.svep.module.lambda-queryGTF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryGTF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/77f5fc22505268186132cdca6ade70c9eeb2d8bf7e8d2a32c607cc2fa4f8324a.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/queryGTF'"
          + "filename_new"   = "builds/77f5fc22505268186132cdca6ade70c9eeb2d8bf7e8d2a32c607cc2fa4f8324a.zip"
          + "filename_old"   = "builds/77f5fc22505268186132cdca6ade70c9eeb2d8bf7e8d2a32c607cc2fa4f8324a.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryGTF"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryGTF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/77f5fc22505268186132cdca6ade70c9eeb2d8bf7e8d2a32c607cc2fa4f8324a.zip"
        }
    }

  # module.svep.module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/ac23f91ad883fa7055de235e487b199ddd46c5e63cbf0aaf02d87538889124a0.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/ac23f91ad883fa7055de235e487b199ddd46c5e63cbf0aaf02d87538889124a0.zip"
          + "filename_old"   = "builds/ac23f91ad883fa7055de235e487b199ddd46c5e63cbf0aaf02d87538889124a0.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryVCF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/ac23f91ad883fa7055de235e487b199ddd46c5e63cbf0aaf02d87538889124a0.zip"
        }
    }

  # module.svep.module.lambda-queryVCFsubmit.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCFsubmit/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/14485579e9c0f4949dfdd464367d34950ff3312e980c1e1a6304ff94fef590ae.zip' 'python3.9' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/svep/lambda/queryVCFsubmit'"
          + "filename_new"   = "builds/14485579e9c0f4949dfdd464367d34950ff3312e980c1e1a6304ff94fef590ae.zip"
          + "filename_old"   = "builds/14485579e9c0f4949dfdd464367d34950ff3312e980c1e1a6304ff94fef590ae.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCFsubmit"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryVCFsubmit.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/14485579e9c0f4949dfdd464367d34950ff3312e980c1e1a6304ff94fef590ae.zip"
        }
    }

Plan: 54 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "pricing_access_key_id"
│ but a value was found in file "hub02.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "pricing_access_secret_key_id" but a value was found in file
│ "hub02.tfvars". If you meant to use this value, add a "variable" block to
│ the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.svep.aws_api_gateway_deployment.VPApi,
│   on svep/api.tf line 281, in resource "aws_api_gateway_deployment" "VPApi":
│  281:   stage_name  = "prod"
│ 
│ The attribute "stage_name" will be removed in a future major version. Use
│ an explicit "aws_api_gateway_stage" instead.
╵
╷
│ Error: No valid credential sources found
│ 
│   with module.cognito.provider["registry.terraform.io/hashicorp/aws"],
│   on cognito/main.tf line 1, in provider "aws":
│    1: provider "aws" {
│ 
│ Please see https://registry.terraform.io/providers/hashicorp/aws
│ for more information about providing credentials.
│ 
│ Error: failed to refresh cached credentials, failed to retrieve
│ credentials, operation error STS: AssumeRoleWithWebIdentity, https response
│ error StatusCode: 403, RequestID: afa38816-c171-473c-81bd-564b8174c0ff, api
│ error AccessDenied: Not authorized to perform sts:AssumeRoleWithWebIdentity
│ 
╵
╷
│ Error: No valid credential sources found
│ 
│   with module.sbeacon.provider["registry.terraform.io/hashicorp/aws"],
│   on sbeacon/main.tf line 1, in provider "aws":
│    1: provider "aws" {
│ 
│ Please see https://registry.terraform.io/providers/hashicorp/aws
│ for more information about providing credentials.
│ 
│ Error: failed to refresh cached credentials, failed to retrieve
│ credentials, operation error STS: AssumeRoleWithWebIdentity, https response
│ error StatusCode: 403, RequestID: 6de3fe57-5c3c-4caf-b2a4-b66ce1702e24, api
│ error AccessDenied: Not authorized to perform sts:AssumeRoleWithWebIdentity
│ 
╵
╷
│ Error: No valid credential sources found
│ 
│   with module.svep.provider["registry.terraform.io/hashicorp/aws"],
│   on svep/main.tf line 1, in provider "aws":
│    1: provider "aws" {
│ 
│ Please see https://registry.terraform.io/providers/hashicorp/aws
│ for more information about providing credentials.
│ 
│ Error: failed to refresh cached credentials, failed to retrieve
│ credentials, operation error STS: AssumeRoleWithWebIdentity, https response
│ error StatusCode: 403, RequestID: 8f4bf160-e7ce-4ec3-bc6c-031e82e0ebe6, api
│ error AccessDenied: Not authorized to perform sts:AssumeRoleWithWebIdentity
│ 
╵
╷
│ Error: No valid credential sources found
│ 
│   with module.webgui.provider["registry.terraform.io/hashicorp/aws"],
│   on webgui/terraform-aws/main.tf line 1, in provider "aws":
│    1: provider "aws" {
│ 
│ Please see https://registry.terraform.io/providers/hashicorp/aws
│ for more information about providing credentials.
│ 
│ Error: failed to refresh cached credentials, failed to retrieve
│ credentials, operation error STS: AssumeRoleWithWebIdentity, https response
│ error StatusCode: 403, RequestID: 0f5c4894-0ef6-4c21-8a5f-cf34c99d33ca, api
│ error AccessDenied: Not authorized to perform sts:AssumeRoleWithWebIdentity
│ 
╵

```
</details>